//
//  WXOMessageBodySystemNotify.h
//  WXOpenIMSDK
//
//  Created by 慕桥(黄玉坤) on 1/28/15.
//  Copyright (c) 2015 taobao. All rights reserved.
//




/*********************************************************************************
 *********************************************************************************
 *********************************************************************************
 *********************************************************************************
 
 * 注意点：所有WXO或者IWXO开头命名的类、接口、类型、常量等都已废弃，请使用YW或者IYW开头的定义 *
 
 *********************************************************************************
 *********************************************************************************
 *********************************************************************************
 *********************************************************************************
 ********************************************************************************/






#import "YWMessageBodySystemNotify.h"


__deprecated_msg("请使用YWMessageBodySystemNotify替代") @interface WXOMessageBodySystemNotify : YWMessageBodySystemNotify


// 系统通知内容
@property (nonatomic, strong, readonly) NSString *content;

// 其他附加数据
@property (nonatomic, strong, readonly) NSDictionary *userData;

@end
