//
//  WXOTribe.h
//  WXOpenIMSDK
//
//  Created by Jai Chen on 15/1/13.
//  Copyright (c) 2015年 taobao. All rights reserved.
//




/*********************************************************************************
 *********************************************************************************
 *********************************************************************************
 *********************************************************************************
 
 * 注意点：所有WXO或者IWXO开头命名的类、接口、类型、常量等都已废弃，请使用YW或者IYW开头的定义 *
 
 *********************************************************************************
 *********************************************************************************
 *********************************************************************************
 *********************************************************************************
 ********************************************************************************/






#import <Foundation/Foundation.h>
#import "YWTribe.h"

/**
 *  群对象
 */
__deprecated_msg("请使用YWTribe替代") @interface WXOTribe : YWTribe

/**
 *  群的唯一标识符
 */
@property (readonly, copy, nonatomic) NSString *tribeId;

/**
 *  群名称
 */
@property (readonly, copy, nonatomic) NSString *tribeName;

/**
 *  群公告
 */
@property (readonly, copy, nonatomic) NSString *notice;


- (BOOL)isEqualToTribe:(WXOTribe *)tribe;

@end
